app/controllers/api/v1/tweets_controller.rb

SELECT "follows"."following_id" FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" IN ($1, $2, $3, $4) ORDER BY created_at DESC  [["user_id", 2], ["user_id", 3], ["user_id", 3], ["user_id", 1]]
---
		def show_tweets
			follow_id = Follow.where(follower_id: @current_user.id).pluck(:following_id)
			ids = follow_id << @current_user.id
			record = Tweet.where(user_id: ids)