app/controllers/api/v1/users_controller.rb

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."following_id" = $2 LIMIT $3  [["follower_id", 1], ["following_id", 2], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."following_id" = $2 LIMIT $3  [["follower_id", 1], ["following_id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
		def unfollow
			followed = Follow.find_by follower_id: @current_user.id, following_id: @user.id
			if followed.present?
				unfollow = followed.delete

SELECT "follows"."id" FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
		def show_current_user_follower
			followers = Follow.where(follower_id: @current_user.id).ids
			record = followers.map { |f|
				follow = Follow.find f
				user = User.find follow.following_id

SELECT "follows"."id" FROM "follows" WHERE "follows"."following_id" = $1  [["following_id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
		def show_current_user_followings
			following = Follow.where(following_id: @current_user.id).ids
			record = following.map { |f|
				follow = Follow.find f
				user = User.find follow.follower_id

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."following_id" = $2 LIMIT $3  [["follower_id", 1], ["following_id", 3], ["LIMIT", 1]]
---
		def check_user_already_follow?
			followed = Follow.find_by follower_id: @current_user.id, following_id: @user.id