app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "akash.d@gmail.com"], ["LIMIT", 1]]